RIOT-OS/RIOT/cpu/esp32/include/periph_cpu.h
/**
 * @name   SPI configuration
 *
 * ESP32x SoCs have up to four SPI controllers dependent on the specific ESP32x
 * SoC variant (family):
 *
 * - Controller SPI0 is reserved for caching external memory like Flash
 * - Controller SPI1 is reserved for external memories like PSRAM
 * - Controller SPI2 can be used as general purpose SPI (GPSPI)
 * - Controller SPI3 can be used as general purpose SPI (GPSPI)
 *
 * The controllers SPI0 and SPI1 share the same bus signals and can only
 * operate in memory mode on most ESP32x SoC variants. Therefore, depending on
 * the specific ESP32x SoC family, a maximum of two SPI controllers can be used
 * as peripheral interfaces:
 *
 * - Controller SPI2 is identified by `SPI2_HOST` (also called FSPI or HSPI)
 * - Controller SPI3 is identified by `SPI3_HOST` (also called VSPI)
 *
 * In former ESP-IDF versions, SPI interfaces were identified by the alias
 * names `FSPI`, `HSPI` and `VSPI`, which are sometimes also used in data
 * sheets. These alias names have been declared obsolete in ESP-IDF. For
 * source code compatibility reasons these alias names are defined here.
 *
 * SPI interfaces could be used in quad SPI mode, but RIOT's low level
 * device driver doesn't support it.
 *
 * The board-specific configuration of the SPI interface SPI_DEV(n) requires
 * the definition of
 *
 * - `SPIn_CTRL`, the SPI controller (`SPI_HOST2`/`SPI_HOST3`) used for SPI_DEV(n),
 * - `SPIn_SCK`, the GPIO used as clock signal used for SPI_DEV(n)
 * - `SPIn_MISO`, the GPIO used as MISO signal used for SPI_DEV(n)
 * - `SPIn_MOSI`, the GPIO used as MOSI signal used for SPI_DEV(n), and
 * - `SPIn_CS0`, the GPIO used as CS signal for SPI_DEV(n) when the `cs`
 *   parameter in #spi_acquire is #GPIO_UNDEF,
 *
 * where `n` can be 0 and 1. If they are not defined, the according SPI
 * interface SPI_DEV(n) is not used, for example:
 * ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~{.c}
 * #define SPI0_CTRL   SPI3_HOST   // VSPI could also be used on ESP32 variant
 * #define SPI0_SCK    GPIO18      // SCK  signal
 * #define SPI0_MISO   GPIO19      // MISO signal
 * #define SPI0_MOSI   GPIO23      // MOSI signal
 * #define SPI0_CS0    GPIO5       // CS0  signal
 *
 * #define SPI1_CTRL   SPI2_HOST   // HSPI could also be used here on ESP32 variant
 * #define SPI1_SCK    GPIO14      // SCK  Camera
 * #define SPI1_MISO   GPIO12      // MISO Camera
 * #define SPI1_MOSI   GPIO13      // MOSI Camera
 * #define SPI1_CS0    GPIO15      // CS0  Camera
 * ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
 *
 * The pin configuration of SPI interfaces can be changed by
 * [application specific configurations](#esp32_application_specific_configurations)
 * by overriding the according `SPIn_*` symbols.
 *
 * @note
 * - To ensure that the `SPIn_*` symbols define the configuration for
 *   SPI_DEV(n), the definition of the configuration of SPI interfaces
 *   SPI_DEV(n) must be in continuous ascending order of `n`.
 *   That is, if SPI_DEV(1) is used by defining the `SPI1_*` symbols,
 *   SPI_DEV(0) must also be used by defining the `SPI0_*` symbols.
 * - The order in which the available interfaces `SPI2_HOST` (alias `HSPI` or
 *   `FSPI`) and `SPI3_HOST` (alias `VPSI` or `HSPI`) are assigned doesn't matter.
 * - The GPIOs listed in the configuration are only initialized as SPI
 *   signals when the `periph_spi` module is used. Otherwise they are not
 *   allocated and can be used for other purposes.
 *
 * #SPI_NUMOF is determined automatically from the board-specific peripheral
 * configuration for SPI_DEV(n).
 *
 * @{
 */

#ifndef DOXYGEN
/**
 * @brief    Override SPI clock speed values
 * @{
 */
#define HAVE_SPI_CLK_T
typedef enum {
    SPI_CLK_100KHZ = 100000,            /**< drive the SPI bus with 100KHz */
    SPI_CLK_400KHZ = 400000,            /**< drive the SPI bus with 400KHz */
    SPI_CLK_1MHZ   = 1000000,           /**< drive the SPI bus with 1MHz */
    SPI_CLK_5MHZ   = 5000000,           /**< drive the SPI bus with 5MHz */
    SPI_CLK_10MHZ  = 10000000           /**< drive the SPI bus with 10MHz */
} spi_clk_t;
/** @} */

/**
 * @brief   SPI pin getters
 * @{
 */
#define spi_pin_mosi(dev) spi_config[dev].mosi
#define spi_pin_miso(dev) spi_config[dev].miso
#define spi_pin_clk(dev)  spi_config[dev].sck
/** @} */

#endif /* !DOXYGEN */

/**
 * @brief   Mapping of SPI controller type for source code compatibility
 */
typedef spi_host_device_t spi_ctrl_t;

/*
 * In former ESP-IDF versions, SPI interfaces were identified by the alias
 * names `FSPI`, `HSPI` and `VSPI`, which are sometimes also used in data
 * sheets. These alias names have been declared obsolete in ESP-IDF. For
 * source code compatibility reasons these alias names are defined here.
 */
#if defined(CPU_FAM_ESP32)
#define HSPI    SPI2_HOST   /**< Alias name for SPI2_HOST as used in former ESP-IDF versions */
#define VSPI    SPI3_HOST   /**< Alias name for SPI3_HOST as used in former ESP-IDF versions */
#elif defined(CPU_FAM_ESP32S2)
#define FSPI    SPI2_HOST   /**< Alias name for SPI2_HOST as used in former ESP-IDF versions */
#define HSPI    SPI3_HOST   /**< Alias name for SPI3_HOST as used in former ESP-IDF versions */
#else
#define FSPI    SPI2_HOST   /**< Alias name for SPI2_HOST as used in former ESP-IDF versions */
#endif

/**
 * @brief   SPI configuration structure type
 */
typedef struct {
    spi_ctrl_t ctrl;        /**< SPI controller used for the interface */
    gpio_t sck;             /**< GPIO used as SCK pin */
    gpio_t mosi;            /**< GPIO used as MOSI pin */
    gpio_t miso;            /**< GPIO used as MISO pin */
    gpio_t cs;              /**< GPIO used as CS0 pin */
} spi_conf_t;

/**
 * @brief   Maximum number of SPI interfaces that can be used by board definitions
 */
#define SPI_NUMOF_MAX   (SOC_SPI_PERIPH_NUM - 1)

#define PERIPH_SPI_NEEDS_TRANSFER_BYTE  /**< requires function spi_transfer_byte */
#define PERIPH_SPI_NEEDS_TRANSFER_REG   /**< requires function spi_transfer_reg */
#define PERIPH_SPI_NEEDS_TRANSFER_REGS  /**< requires function spi_transfer_regs */
/** @} */

/**
 * @name   Timer configuration depending on which implementation is used
 *
 * There are two different implementations for hardware timers.
 *
 * - **Timer Module implementation** Depending on the ESP32x SoC variant
 *   (family) it provides up to 4 high speed timers, where 1 timer is used for
 *   system time. The remaining timer devices with **1 channel** each can be
 *   used as RIOT timer devices with a clock rate of 1 MHz.
 * - **Counter implementation** Dependent on the ESP32x SoC variant (family),
 *   the MCU has up to 3 CCOMPARE (cycle compare) registers. Two of them can be
 *   used to implement up to **2 timer devices** with **1 channel** each and a
 *   clock rate of 1 MHz. This is a feature of Xtensa-based ESP32x SoC variants.
 *
 * By default, the timer module is used. To use the counter implementation, add
 * ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
 * USEMODULE += esp_hw_counter
 * ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
 * to application's makefile.
 *
 * Timers are MCU built-in features and not board-specific. There is nothing to
 * be configured.
 * @{
 */

#ifndef MODULE_ESP_HW_COUNTER
/**
 * @brief Hardware timer modules are used for timer implementation (default)
 *
 * Since one timer is used for the system time, there is one timer less than
 * the total number of timers.
 */
#define TIMER_NUMOF         (SOC_TIMER_GROUP_TOTAL_TIMERS - 1)
#define TIMER_CHANNEL_NUMOF (1)
#endif

/** Timer group used for system time */
#define TIMER_SYSTEM_GROUP      TIMER_GROUP_0
/** Index of the timer in the timer timer group used for system time */
#define TIMER_SYSTEM_INDEX      TIMER_0
/** System time interrupt source */
#define TIMER_SYSTEM_INT_SRC    ETS_TG0_T0_LEVEL_INTR_SOURCE

/** @} */

/**
 * @brief   Prevent shared timer functions from being used
 */
#define PERIPH_TIMER_PROVIDES_SET

/**
 * @name   UART configuration
 *
 * ESP32x SoCs integrate up to three UART devices, depending on the specific
 * ESP32x SoC variant (family).
 *
 * The pin configuration of the UART device UART_DEV(n) is defined in the
 * board-specific peripheral configuration by
 *
 * - `UARTn_TXD`, the GPIO used as TxD signal for UART_DEV(n), and
 * - `UARTn_RXD`, the GPIO used as RxD signal for UART_DEV(n),
 *
 * where `n` can be in range of 0 and UART_NUMOF_MAX-1. If they are not defined,
 * the according UART interface UART_DEV(n) is not used, for example:
 * ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~{.c}
 * #define UART1_TX    GPIO10  // TxD signal of UART_DEV(1)
 * #define UART1_RX    GPIO9   // RxD signal of UART_DEV(1)
 * ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
 *
 * The pin configuration of UART interfaces can be changed by
 * [application specific configurations](#esp32_application_specific_configurations)
 * by overriding the according `UARTn_*` symbols.
 *
 * @note To ensure that the `UARTn_*` symbols define the configuration for
 *       UART_DEV(n), the configuration of the UART interfaces UART_DEV(n)
 *       must be in continuous ascending order of `n`. That is, if UART_DEV(1)
 *       is to be used by defining the `UART1_*` symbols, UART_DEV(0) must also
 *       be used by defining the `UART0_*` symbols, and if UART_DEV(2)
 *       is to be used by defining the `UART2_*` symbols, UART_DEV(0) and
 *       UART_DEV(1) must also be used by defining the `UART0_*` and
 *       `UART1_*` symbols
 *
 * #UART_NUMOF is determined automatically from the board-specific peripheral
 * configuration for UART_DEV(n).
 *
 * UART_DEV(0) has usually a fixed pin configuration that is used by all
 * ESP32x boards as standard configuration for the console. The GPIOs
 * used for UART_DEV(0) depend on the ESP32x SoC family.
 *
 * @{
 */

/**
 * @brief   UART configuration structure type
 */
typedef struct {
    gpio_t txd;             /**< GPIO used as TxD pin */
    gpio_t rxd;             /**< GPIO used as RxD pin */
} uart_conf_t;

/**
 * @brief   Maximum number of UART interfaces
 */
#define UART_NUMOF_MAX      (SOC_UART_NUM)
/** @} */

/**
 * @name   USB device configuration
 * @{
 *
 * ESP32x SoCs integrate depending on the specific ESP32x SoC variant (family)
 * an USB OTG FS controller based on the Synopsys DWC2 IP core.
 */
#include "usbdev_synopsys_dwc2.h"

/**
 * @brief   Maximum number of USB OTG FS interfaces
 */
#define USBDEV_NUMOF_MAX    (SOC_USB_PERIPH_NUM)
/** @} */

#ifdef __cplusplus
}
#endif

/**
 * @brief   Include ESP32x family specific peripheral configuration
 */
#if defined(CPU_FAM_ESP32)
#include "periph_cpu_esp32.h"
#elif defined(CPU_FAM_ESP32C3)
#include "periph_cpu_esp32c3.h"
#elif defined(CPU_FAM_ESP32S2)
#include "periph_cpu_esp32s2.h"
#elif defined(CPU_FAM_ESP32S3)
#include "periph_cpu_esp32s3.h"
#else
#error "ESP32x family implementation missing"
#endif

#ifdef MODULE_PERIPH_CAN
#include "can_esp.h"
#endif

#endif /* PERIPH_CPU_H */
/** @} */
